[
  {
    "Area": "Написание кода",
    "Cases": "Написание кода",
    "Bronze": "Локально.",
    "Silver": "Централизовано в Git системе команды.",
    "Gold": "В централизованном Github Adeo, используется практика Code Review для мержда в главную ветку.",
    "Platinum": "В централизованном Github Adeo, используется практика Code Review для мержда в главную ветку."
  },
  {
    "Area": "Написание кода",
    "Cases": "Покрытие юнит-тестами",
    "Bronze": "0%",
    "Silver": "Меньше 20%",
    "Gold": "Между 20% и 80%",
    "Platinum": "Больше 80%"
  },
  {
    "Area": "Сборка",
    "Cases": "Хранение артефактов",
    "Bronze": "Сборка не автоматизирована.",
    "Silver": "Артефакты автоматически собираются и версионируются по <a href=\"https://semver.org/lang/ru/\">семверу</a>.",
    "Gold": "Артефакты автоматически собираются и версионируются по семверу. <b>Используется, хранение дистрибутивов в Artifactory, единая сборка для всех сред. Дистрибутив отделен от конфигурации.</b>",
    "Platinum": "Артефакты автоматически собираются и версионируются по семверу. Используется, <b>единый формат и централизованное</b> хранение дистрибутивов в Artifactory, единая сборка для всех сред."
  },
  {
    "Area": "Сборка",
    "Cases": "Обратная связь",
    "Bronze": "Артефакт собирается вне зависимости от проверок.",
    "Silver": "Артефакт собирается вне зависимости от проверок.",
    "Gold": "Результаты тестов и статических анализаторов влияют на сборку.",
    "Platinum": "Падение пайплайнов при непрохождении проверок. Результаты проверок на безопасность влияют на сборку."
  },
  {
    "Area": "Тестирование",
    "Cases": "Статический анализ кода",
    "Bronze": "Не используется.",
    "Silver": "Анализируется правилами по-умолчанию.",
    "Gold": "Автоматический запуск тестов с помощью централизованного инструмента развертывания. Sonarqube Quality ≥ B. Quality Gate учитывает покрытие, интеграция с Checkmarx.",
    "Platinum": "Автоматический запуск тестов с помощью централизованного инструмента развертывания. Sonarqube Quality ≥ B. Quality Gate учитывает покрытие, интеграция с Checkmarx."
  },
  {
    "Area": "Тестирование",
    "Cases": "Функциональное тестирование",
    "Bronze": "Не проводится.",
    "Silver": "Не проводится.",
    "Gold": "Меньше 80% тест кейсов автоматизированы. Тест кейсы ведутся в системе управления тестами Allure.",
    "Platinum": "Больше 80% тест кейсов автоматизированы. Тест кейсы ведутся в системе управления тестами Allure."
  },
  {
    "Area": "Тестирование",
    "Cases": "Интеграционное тестирование",
    "Bronze": "Не проводится.",
    "Silver": "Интеграционное тестирование проводится вручную.",
    "Gold": "Автоматизированное интеграционное тестирование.",
    "Platinum": "Применяется автоматизированное контрактное тестирование с ипользованием централизованной базы контрактов. *Пункт пока не достижим, можно достичь платины без него.*"
  },
  {
    "Area": "Тестирование",
    "Cases": "Нагрузочное тестирование",
    "Bronze": "Не проводится.",
    "Silver": "Запускается периодически вручную. Автоматический сбор результатов нагрузочного тестирования, с помощью централизованного инструмента развертывания.",
    "Gold": "Автоматический сбор <b>и анализ результатов</b> нагрузочного тестирования, с помощью централизованного инструмента развертывания.",
    "Platinum": "<b>Автоматическая подготовка среды</b>, а также сбор и анализ результатов нагрузночного тестирования, с помощью централизованного инструмента развертывания."
  },
  {
    "Area": "Тестирование",
    "Cases": "Проверка безопасности",
    "Bronze": "Не проводится.",
    "Silver": "Не проводится.",
    "Gold": "Автоматический анализ зависимостей на наличие уязвимостей (OSA). Проверки зависимостей на безопасность с X-Ray, интегрированным с Artifactory.",
    "Platinum": "Автоматический анализ зависимостей на наличие уязвимостей (OSA). Проверки зависимостей на безопасность с X-Ray, интегрированным с Artifactory. <b>Периодическое динамическое тестирование безопасности по запросу (DAST) и интерактивное тестирование ИБ (IAST)</b>."
  },
  {
    "Area": "Тестирование",
    "Cases": "Моделирование угроз",
    "Bronze": "Не проводится.",
    "Silver": "Не проводится.",
    "Gold": "Не проводится.",
    "Platinum": "Все компоненты оцениваются по модели угроз <a href=\"https://en.wikipedia.org/wiki/STRIDE_(security)\" target=\"_blank\">STRIDE</a>, либо <a href=\"https://en.wikipedia.org/wiki/Attack_tree\">Attack tree</a>."
  },
  {
    "Area": "Тестирование",
    "Cases": "Smoke тестирование",
    "Bronze": "Не проводится.",
    "Silver": "Ручные smoke-тесты после развертывания.",
    "Gold": "Автоматическая проверка установки через smoke-тесты.",
    "Platinum": "Автоматическая проверка установки через smoke-тесты."
  },
  {
    "Area": "Релиз и развертывания",
    "Cases": "Доставка",
    "Bronze": "Развертывание производится в ручном режиме. ",
    "Silver": "Автоматическая установка скриптом, запускаемым вручную.",
    "Gold": "Автоматическая установка с применением единообразных сценариев развертывания, включая настройки.",
    "Platinum": "Автоматическая установка с применением единообразных сценариев развертывания, включая настройки. <b>Динамические среды по требованию.</b>"
  },
  {
    "Area": "Релиз и развертывания",
    "Cases": "Развертывание",
    "Bronze": "Откат приложений осуществляется вручную. ",
    "Silver": "<b>Использование инструмента управления релизами (Voyager) и его интеграция в процесс развертывания. </b> Откат приложений осуществляется вручную. ",
    "Gold": "Использование инструмента управления релизами (Voyager) и его интеграция в процесс развертывания. <b>Автоматическая миграция БД. Автоматический откат приложений.</b>",
    "Platinum": "Использование инструмента управления релизами (Voyager) и его интеграция в процесс развертывания. Автоматическая миграция БД. Автоматический откат приложений. <b>Автоматическое Canary/Blue-Green развертывание. Автоматическая создание дефектов в системе управления дефектами, если процесс развертывания завершился неудачно.</b>"
  },
  {
    "Area": "Релиз и развертывания",
    "Cases": "Управление секретами",
    "Bronze": "Хранение секретов соответствует минимальным требованиям безопасности.",
    "Silver": "Хранение секретов соответствует минимальным требованиям безопасности.",
    "Gold": "Секреты хранятся и используются с соблюдением требований информационной безопасности. <b>Секреты хранятся в одном из защищенных хранилищ.</b>",
    "Platinum": "Секреты хранятся и используются с соблюдением требований информационной безопасности. Секреты хранятся в одном из защищенных хранилищ. <b>Секреты для прода не используются в других окружениях.</b>"
  },
  {
    "Area": "Эксплуатация",
    "Cases": "Логирование",
    "Bronze": "Отсутствует логирование.",
    "Silver": "Сбор и анализ логов ведется через инструмент хранения и визуализации.",
    "Gold": "Сбор и анализ логов ведется через инструмент хранения и визуализации.",
    "Platinum": "Сбор и анализ логов ведется через инструмент хранения и визуализации. <b>Логирование ведется согласно корпоративному стандарту.</b>"
  },
  {
    "Area": "Эксплуатация",
    "Cases": "Мониторинг",
    "Bronze": "Сбор метрик ведется через Prometheus.",
    "Silver": "Сбор метрик ведется через Prometheus.",
    "Gold": "Сбор метрик ведется через Prometheus.<b> Настроены SLO по техническим метрикам через корпоративный инструмент мониторинга.</b> Доступность, быстродействие, нагрузка.",
    "Platinum": "Сбор метрик ведется через Prometheus. Настроены SLO по техническим метрикам через корпоративный инструмент мониторинга. <b>Настроены SLO по бизнес метрикам через корпоративный инструмент мониторинга.</b>"
  },
  {
    "Area": "Эксплуатация",
    "Cases": "Алертинг",
    "Bronze": "Отсутствуют уведомления о сбоях.",
    "Silver": "Уведомления о сбоях отправляются в неструктурированые каналы коммуникации.",
    "Gold": "Уведомления об сбоях ведутся <b>через единую систему управления инцидентами и коммуникациями. OpsGenie </b>",
    "Platinum": "Уведомления об сбоях ведутся через единую систему управления инцидентами и коммуникациями. OpsGenie <b>Поддержка приложений осуществляется непрерывно на основе матрицы эскалации и расписании дежурств.</b>"
  }
]